         IDENTIFICATION DIVISION.  *> identifying the program
         PROGRAM-ID. HELLOWORLD.   *> name of the program
         PROCEDURE DIVISION.       *> real code starts from here
              DISPLAY 'HELLO WORLD'. *> REAL CODE OF THE PROGRAM
              STOP RUN.
