      ******************************************************************
      * Author: Henrique S. Mendes
      * Date: 10/05/2022
      * Purpose: Study
      * Tectonics: cobc
      ******************************************************************
         IDENTIFICATION DIVISION.
         PROGRAM-ID. VarStudy.
         DATA DIVISION.
         FILE SECTION.
         WORKING-STORAGE SECTION.
         PROCEDURE DIVISION.


       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM VarStudy.
